Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ImportContainedUnsupportedTransform
The imported geometry contains transformations which Revit does not support. Some objects may be displaced or distorted.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ImportContainedUnsupportedGeometricData
The original model contains unsupported geometric data.